Blogs/app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT * FROM `blogs`

  def show
    @blog = Blog.find(params[:id])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 1)

  def create
    blog = Blog.new
    blog.title = params[:title]
    blog.content = params[:content]
    if blog.save
---
INSERT INTO `blogs` (`updated_at`, `title`, `content`, `created_at`) VALUES('2011-12-08 15:59:37', 't1', 'c1', '2011-12-08 15:59:37')

  def edit
    @blog = Blog.find(params[:id])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 1)

  def update
    blog = Blog.find(params[:id])
    blog.title = params[:title]
    blog.content = params[:content]
    if blog.save
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 0)
UPDATE `blogs` SET `content` = 'c111', `title` = 't111', `updated_at` = '2011-12-08 16:42:39' WHERE `id` = 1

  def destroy
    if Blog.destroy(params[:id])
---
DELETE FROM `blogs` WHERE `id` = 1