module PartialConstant

  #首页
  YLSBK = "1101" #杨老师博客
  FCZS = "1102"  #风采展示
  BJX = "1103"   #班级秀

  #父母学堂
  JZHD = "1104" #家长互动
  #招考信息
  YXZS = "1105" #院校招生信息

  #网络班级
  BJMX = "1106" #班级明星
  TJBJ = "1107" #推荐班级
  ZSM = "1108" #看看大家都在做什么

  #墨香书屋
  TSPH = "1109"  #图书排行
  TJTS = "1110"  #推荐图书
  TJSP = "1111"  #推荐书评

  #特色博友
  TSBY_PIC_1 ="10001"
  #学生成长袋
  XSCZD_PIC_1 = "10101"
  XSCZD_PIC_2 = "10102"
  #家长互动营
  JZHDY_PIC_1 ="10201"
  JZHDY_PIC_2 ="10202"
  JZHDY_PIC_3 ="10203"
  JZHDY_PIC_4 ="10204"
  #教师耕耘录
  JSGYL_PIC_1 = "10301"
  JSGYL_PIC_2 = "10302"
  JSGYL_PIC_3 = "10303"
  JSGYL_PIC_4 = "10304"


  YLSBK_PIC = "2101"  #杨老师博客
  FCZS_PIC = "2102"  #风采展示

  #班级秀
  BJX_PIC_1 = "3101"
  BJX_PIC_2 = "3102"
  BJX_PIC_3 = "3103"
  BJX_PIC_4 = "3104"
  BJX_PIC_5 = "3105"
  BJX_PIC_6 = "3106"

  #家长互动
  JZHD_PIC_1 = "4101"
  JZHD_PIC_2 = "4102"
  JZHD_PIC_3 = "4103"

  #班级明星
  BJMX_PIC_1 = "5101"
  BJMX_PIC_2 = "5102"
  BJMX_PIC_3 = "5103"
  BJMX_PIC_4 = "5104"
  BJMX_PIC_5 = "5105"

  #推荐班级
  TJBJ_PIC_1 = "6101"
  TJBJ_PIC_2 = "6102"
  TJBJ_PIC_3 = "6103"

  #照片
  ZP_PIC_1 = "0101"
  ZP_PIC_2 = "0102"
  ZP_PIC_3 = "0103"

  #图书排行
  TSPH_PIC_1 = "7101"
  TSPH_PIC_2 = "7102"
  TSPH_PIC_3 = "7103"
  TSPH_PIC_4 = "7104"
  TSPH_PIC_5 = "7105"
  TSPH_PIC_6 = "7106"
  TSPH_PIC_7 = "7107"
  TSPH_PIC_8 = "7108"
  TSPH_PIC_9 = "7109"
  TSPH_PIC_10 = "7110"

  #推荐图书
  TJTS_PIC_1 = "8101"
  TJTS_PIC_2 = "8102"
  TJTS_PIC_3 = "8103"
  TJTS_PIC_4 = "8104"
  TJTS_PIC_5 = "8105"

  #推荐书评
  TJSP_PIC_1 = "9101"
  TJSP_PIC_2 = "9102"
  TJSP_PIC_3 = "9103"
  TJSP_PIC_4 = "9104"
  TJSP_PIC_5 = "9105"

  #首页
  INDEX_PICTURE_ARR = [
    "2101", "杨老师博客图", "2102", "风采展示图", "3101", "班级秀图1", "3102", "班级秀图2",
    "3103", "班级秀图3", "3104", "班级秀图4", "3105", "班级秀图5", "3106", "班级秀图6"
  ]

  #父母学堂
  JZHD_PICTURE_ARR = [
    "4101", "家长互动图1", "4102", "家长互动图2", "4103", "家长互动图3"
  ]

  #网络班级
  WLBJ_PICTURE_ARR = [
    "5101", "班级明星图1", "5102", "班级明星图2", "5103", "班级明星图3", "5104", "班级明星图4", "5105", "班级明星图5", "0101", "照片1",
    "0102", "照片2", "0103", "照片3", "6101", "推荐班级图1", "6102", "推荐班级图2", "6103", "推荐班级图3"
  ]


  #博客空间
  RZPHB = "1112" #日志排行榜
  TSBY = "1113" #特色博友
  XSCZD = "1114" #学生成长袋
  JZHDY = "1115" #家长互动营
  JSGYL = "1116" #教师耕耘录

  #分校首页
  FXDTTP = "1117" #分校动态图片展示
  FXZS = "1118" #分校展示
  FXDT = "1119" #分校动态

  FXDTTP_PIC = "1201"
  FXZS_PIC_1 = "1202"
  FXZS_PIC_2 = "1203"
  FXZS_PIC_3 = "1204"
  FXZS_PIC_4 = "1205"
  FXDT_PIC_1 = "1301"
  FXDT_PIC_2 = "1302"
  FXDT_PIC_3 = "1303"
  FXDT_PIC_4 = "1304"
  FXDT_PIC_5 = "1305"
  FXDT_PIC_6 = "1306"
  FXDT_PIC_7 = "1307"
  FXDT_PIC_8 = "1308"
  FXDT_PIC_9 = "1309"

  FX_PICTURE_ARR = [
    "1201", "分校动态展示图", "1202", "分校展示图1", "1203", "分校展示图2", "1204", "分校展示图3", "1205", "分校展示图4",
    "1301", "分校动态图1", "1302", "分校动态图2", "1303", "分校动态图3", "1304", "分校动态图4", "1305", "分校动态图5",
    "1306", "分校动态图6", "1307", "分校动态图7", "1308", "分校动态图8", "1309", "分校动态图9"
  ]

  BLOG_PICTURE_ARR = [
    "10001", "特色博友图1", "10101", "学生成长袋图1", "10102", "学生成长袋图2", "10201",
    "家长互动营图1", "10202", "家长互动营图2", "10203", "家长互动营图3", "10204", "家长互动营图4", "10301",
    "教师耕耘录图1", "10302", "教师耕耘录图2", "10303", "教师耕耘录图3", "10304", "教师耕耘录图4"
  ]

  #墨香书屋
  MXSW_PICTURE_ARR =[
    "7101", "图书排行图1", "7102", "图书排行图2", "7103", "图书排行图3", "7104", "图书排行图4", "7105", "图书排行图5",
    "7106", "图书排行图6", "7107", "图书排行图7", "7108", "图书排行图8", "7109", "图书排行图9", "7110", "图书排行图10",
    "8101", "推荐图书图1", "8102", "推荐图书图2", "8103", "推荐图书图3", "8104", "推荐图书图4", "8105", "推荐图书图5",
    "9101", "推荐书评图1", "9102", "推荐书评图2", "9103", "推荐书评图3", "9104", "推荐书评图4", "9105", "推荐书评图5"
  ]

  TEMP_FILE_PATH = "/uploads/parent_school_index/html/temp"
  ONLINE_FILE_PATH = "/uploads/parent_school_index/html/online"
  PICTURE_TEMP_FILE_PATH = "/uploads/parent_school_index/pictures/temp"
  PICTURE_ONLINE_FILE_PATH = "/uploads/parent_school_index/pictures/online"
  
end